import { segmenter } from './segmenter';

const text = `\\h Titus
\\id TIT, Bhadrawahi_Bhadrawahi_ltr, EN_ULB, Sat Jul 15 2017 21:23:37 GMT-0400 (EDT)
\\c 1
\\p
\\v 1 पौलुसेरे|
\\v 2 तैस हमेंशरी|
\\s क्रेते
\\v 5 मीं तू|
\\v 6 ज़ैना बेइलज़ाम
\\v 7 किजोकी रखवालो|
\\c 2
\\p
\\v 1 पण तू एरी गल्लां ज़ो, ज़ैना रोड़ी तालीमारे काबलन|
\\p
\\v 2 मतलब बुडडे मड़द, प्रहेज़ केरने बाले, ते समझ़दार ते संयमी भोंन, ते तैन केरो विशवास ते प्रेम, ते सबर पक्की भोए|
\\c 3
\\p
\\v 1 लोकन याद करा, कि हाकिमां, ते अधिकैरी केरे आधीन रहन, ते तैन केरो हुकम मन्न, ते हर एकी रोड़े कम्मेरे लेई तियार रहन|
\\v 2 कोंची बदनाम न केरन; लड़ाके न भोंन: पण नर्म सुभावेरे भोंन, ते सैभी मैंन्हन सैहीं साथी बेड़ी नेरमी सैहीं रहन|
\\s खास हदायत ते अभिवादन
\\v 3 किजोकी अस भी पेहिले, बे अकल, ते हुकम न मन्ने बाले, ते धोखो खाने बाले, ते रंगा रंगा केरी खूवैशन ते एशेरे गुलैमी मां थी, ते बैर, ते जलन रखने मां ज़िन्दगी बीताते थी, ते भिटे, ते एकी होरी सैहीं बैर रखते थी|`


test('segments chapters', () => {
  const regex = /(^|\\c +\d+)(\n|.)+?(?=(\\c +\d+|$))/g;
  const result = segmenter({text, regex});
  const expected = []
  expect(result).toBe(expected);
});